<?php
$sh = array ("'<script[^>]*?>.*?</script>'si",  // Вырезает javaScript
             "'<[\/\!]*?[^<>]*?>'si",           // Вырезает HTML-теги
             "'([\r\n])[\s]+'",                 // Вырезает пробельные символы
             "'&(quot|#34);'i",                 // Заменяет HTML-сущности
             "'&(amp|#38);'i",
             "'&(lt|#60);'i",
             "'&(gt|#62);'i",
             "'&(nbsp|#160);'i",
             "'&(iexcl|#161);'i",
             "'&(cent|#162);'i",
             "'&(pound|#163);'i",
             "'&(copy|#169);'i",
             "'&#(\d+);'e"); 

$rp = array ("",
             "",
             "\\1",
             "\"",
             "&",
             "<",
             ">",
             " ",
             chr(161),
             chr(162),
             chr(163),
             chr(169),
             "chr(\\1)");

$sh_prog_name=array (	"/(\s)+/",
						"/(:)+/",
						"/(\/)+/"
						);

$rp_prog_name=array (	"-",
						"-",
						"-"
); 

?>